## Staging: load_testing
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.policy will be destroyed
  # (because aws_ecr_lifecycle_policy.policy is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "policy" {
      - id          = "load_test" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "Keep last 5 images"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber   = 5
                          - countType     = "imageCountMoreThan"
                          - tagPrefixList = [
                              - "v",
                            ]
                          - tagStatus     = "tagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "687401027353" -> null
      - repository  = "load_test" -> null
    }

  # aws_ecr_repository.load_test_repository will be destroyed
  # (because aws_ecr_repository.load_test_repository is not in configuration)
  - resource "aws_ecr_repository" "load_test_repository" {
      - arn                  = "arn:aws:ecr:ca-central-1:687401027353:repository/load_test" -> null
      - id                   = "load_test" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "load_test" -> null
      - registry_id          = "687401027353" -> null
      - repository_url       = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/load_test" -> null
      - tags                 = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all             = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_lambda_function.load_testing will be created
  + resource "aws_lambda_function" "load_testing" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "A function that runs a locust load test"
      + function_name                  = "LoadTesting"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 200
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/LoadTestLambda"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOCUST_HATCH_RATE"  = "1"
              + "LOCUST_HOST"        = "https://forms-staging.cdssandbox.xyz"
              + "LOCUST_LOCUSTFILE"  = "locust_test_file.py"
              + "LOCUST_NUM_CLIENTS" = "1"
              + "LOCUST_RUN_TIME"    = "3m"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
